Function Reference

# Worksheets

| | | |
|---|---|---|
| ActSSheet <sub>*obsolete in VectorWorks9.0*</sub> | AddWSColumnOperator | AreWorksheetGridLinesVisible |
| AutoFitWSRowHeights | CellHasNum <sub>*obsolete in VectorWorks9.0*</sub> | CellHasStr <sub>*obsolete in VectorWorks9.0*</sub> |
| CellString <sub>*obsolete in VectorWorks9.0*</sub> | CellValue <sub>*obsolete in VectorWorks9.0*</sub> | ClearWSCell |
| CloseSS <sub>*obsolete in VectorWorks9.0*</sub> | CreateWS | CreateWSImage |
| DeleteWSColumns | DeleteWSRows | EnableDrawingWorksheetPalette |
| GetCAlign <sub>*obsolete in VectorWorks9.0*</sub> | GetCellNum <sub>*obsolete in VectorWorks9.0*</sub> | GetCellStr <sub>*obsolete in VectorWorks9.0*</sub> |
| GetCWidth <sub>*obsolete in VectorWorks9.0*</sub> | GetSprdSortSum <sub>*obsolete in VectorWorks9.0*</sub> | GetSprdSortSumColumns <sub>*obsolete in VectorWorks9.0*</sub> |
| GetTopVisibleWS | GetWSAutoRecalcState | GetWSCellAlignment |
| GetWSCellBorder | GetWSCellFill | GetWSCellFormula |
| GetWSCellFormulaN | GetWSCellNumberFormat | GetWSCellsImgDPIRes |
| GetWSCellString | GetWSCellStringN | GetWSCellTextAngle |
| GetWSCellTextColor | GetWSCellTextFormat | GetWSCellValue |
| GetWSCellVertAlignment | GetWSCellWrapTextFlag | GetWSColumnOperators |
| GetWSColumnSortPrecedence | GetWSColumnSortType | GetWSColumnWidth |
| GetWSFromImage | GetWSImage | GetWSImageScaleF |
| GetWSImgAngle | GetWSImgComponent | GetWSImgMarginSize |
| GetWSImgRenderMode | GetWSImgScale | GetWSImgShowDBHeader |
| GetWSImgSize | GetWSImgSizeType | GetWSImgType |
| GetWSImgUseLayScale | GetWSImgUseObjectImg | GetWSImgView |
| GetWSMergedCellRange | GetWSPlacement | GetWSRowColumnCount |
| GetWSRowHeight | GetWSRowHLockState | GetWSSelection |
| GetWSSubrowActualCellString | GetWSSubrowActualStringN | GetWSSubrowCellString |
| GetWSSubrowCellStrN | GetWSSubrowCellValue | GetWSSubrowCount |
| GetWSSubrowHeight | HasWSColumnOperator | InsertWSColumns |
| InsertWSRows | IsValidWSCell | IsValidWSRange |
| IsValidWSSubrowCell | IsWSCellNumber | IsWSCellString |
| IsWSDatabaseRow | IsWSImg | IsWSSubrowCellNumber |
| IsWSSubrowCellString | IsWSVisible | LoadCell <sub>*obsolete in VectorWorks9.0*</sub> |
| MoveWSColumnOperator | NewSprdSheet <sub>*obsolete in VectorWorks9.0*</sub> | RecalculateWS |
| RemoveAllWSColumnOperators | RemoveWSColumnOperator | SelectSS <sub>*obsolete in VectorWorks9.0*</sub> |
| SetSprdSortSum <sub>*obsolete in VectorWorks9.0*</sub> | SetSprdSortSumColumns <sub>*obsolete in VectorWorks9.0*</sub> | SetTopVisibleWS |
| SetWorksheetGridLinesVisibility | SetWSAutoRecalcState | SetWSCellAlignment |
| SetWSCellBorder <sub>*obsolete in VectorWorks12.0*</sub> | SetWSCellBorders | SetWSCellBottomBN |
| SetWSCellBottomBorder <sub>*obsolete in Vectorworks 2019*</sub> | SetWSCellFill | SetWSCellFormula |
| SetWSCellFormulaN | SetWSCellInsideHorizBorder <sub>*obsolete in Vectorworks 2019*</sub> | SetWSCellInsideHzBN |
| SetWSCellInsideVertBorder <sub>*obsolete in Vectorworks 2019*</sub> | SetWSCellInsideVtBN | SetWSCellLeftBN |
| SetWSCellLeftBorder <sub>*obsolete in Vectorworks 2019*</sub> | SetWSCellNumberFormat | SetWSCellOutlineBN |
| SetWSCellOutlineBorder <sub>*obsolete in Vectorworks 2019*</sub> | SetWSCellRightBN | SetWSCellRightBorder <sub>*obsolete in Vectorworks 2019*</sub> |
| SetWSCellsImgDPIRes | SetWSCellTextColor | SetWSCellTextFormat |
| SetWSCellTopBN | SetWSCellTopBorder <sub>*obsolete in Vectorworks 2019*</sub> | SetWSCellVertAlignment |
| SetWSCellWrapTextFlag | SetWSColumnOperators | SetWSColumnSortType |
| SetWSColumnWidth | SetWSCurrentCell | SetWSImageScaleF |
| SetWSImgAngle | SetWSImgComponent | SetWSImgMarginSize |
| SetWSImgRenderMode | SetWSImgScale | SetWSImgShowDBHeader |
| SetWSImgSize | SetWSImgSizeType | SetWSImgType |
| SetWSImgUseLayScale | SetWSImgUseObjectImg | SetWSImgView |
| SetWSPlacement | SetWSRowHeight | SetWSSelection |
| SetWSTextAngle | ShowWS | ShowWSDialog |
| SprdAlign <sub>*obsolete in VectorWorks9.0*</sub> | SprdBorder <sub>*obsolete in VectorWorks9.0*</sub> | SprdFormat <sub>*obsolete in VectorWorks9.0*</sub> |
| SprdSize <sub>*obsolete in VectorWorks9.0*</sub> | SprdWidth <sub>*obsolete in VectorWorks9.0*</sub> | TargetSprdSheet <sub>*obsolete in VectorWorks9.0*</sub> |
| WorksheetMergeCells | WorksheetSplitCells | WSScript_AddHandle |
| WSScript_AddHandleId | WSScript_GetEdit | WSScript_GetEditObj |
| WSScript_GetObject | WSScript_GetPrmInt | WSScript_GetPrmReal |
| WSScript_GetPrmStr | WSScript_SetResImage | WSScript_SetResInt |
| WSScript_SetResReal | WSScript_SetResStr